Revit 2027 API
FabricationPart.SplitStraight(Document, ElementId, XYZ) Method
 Splits the straight into two at the passed in point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SplitStraight(
	Document document,
	ElementId partId,
	XYZ position
)
Public Function SplitStraight (
	document As Document,
	partId As ElementId,
	position As XYZ
) As ElementId
public:
ElementId^ SplitStraight(
	Document^ document,
	ElementId^ partId,
	XYZ^ position
)
member SplitStraight :
        document : Document *
        partId : ElementId *
        position : XYZ -> ElementId
Parameters
document Document
 The document.
partId ElementId
 Identifier of the straight to split.
position XYZ
 The position to split in the straight.
Return Value
ElementId
 Returns the element identifier of the new straight.
Exceptions
Exception | Condition
ArgumentException |  The part is not a straight. -or- The position is not on the straight.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
SplitStraight Overload
Autodesk.Revit.DB Namespace